erpdev.СХК_Расширение/src/DataProcessors/СХК_МобильныйСкладСырье/СХК_МобильныйСкладСырье.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СХК_МобильныйСкладСырье</name>
  <attributes>
    <name>Склад</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокГодности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабПриемка</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтихКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСобрано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

erpdev.СХК_Расширение/src/Documents/ПриходныйОрдерНаТовары/ПриходныйОрдерНаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="6a90e124-5af0-4a37-8ff7-14481b8cb2dd">
  <name>ПриходныйОрдерНаТовары</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="5dcdee8c-9444-4bd3-ae94-e55f618ed216">
    <name>Распоряжение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5a3dfe1b-75d0-4247-8d64-84bab203cf9c">
    <name>Отправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bbce78e7-d91d-4dac-8a0c-b47e64d9325b">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9cd3d95f-95cb-4f59-909e-802e5579ac5b">
    <name>ДатаВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="8762c46f-68da-4109-a1f4-fb201e69cf69">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f481b21a-9531-4e52-9957-c494f5e377f6">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0c0f355e-967b-4aef-9cf3-b95cc9fdfcef">
    <name>НомерВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d0368be3-8269-42f8-b1e8-5a902ab8fbd0">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="95326fc6-5780-440a-84af-cd29440e2b58">
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ca8589c8-0a63-4506-aa59-5684f62c08c1">
    <name>ЗонаПриемки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8a679cf3-b805-4f49-bee6-d93a2702e946">
    <name>СкладскаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b49b6320-3833-4d7e-9256-844ccbfa090e">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="06e8c720-eb9f-425a-9716-baef1a36e9a3">
    <name>Исполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0cdca97b-7d3f-41b0-a49d-95b6449dd7ac">
    <name>РежимПросмотраПоТоварам</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="efa8b93c-791b-4449-99fd-217a3baf3df6">
    <name>ВсегоМест</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="4c33a3ea-7a9b-4d40-8f7d-a7581e73da16">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="91453e18-03ae-4724-8a0e-3401542ee57a">
      <name>ДокументОтгрузки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="75e84f0f-f847-4153-b485-7a92a831f94b">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="dfa19489-ad65-49e8-bcaa-38abf251ab1a">
      <name>УпаковочныйЛистРодитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="193cb4c0-81db-49ab-a130-d34f2a776519">
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="eeb10de4-4d97-4473-b2ac-e752ff3ab390">
      <name>Комментарий</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="9dd9c28c-0ab6-479c-907f-118c9feac29e">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="fa78140c-0253-4803-87da-cf38870a1ab3">
      <name>Штрихкод</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>200</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="8496f61d-538d-4d21-80c3-b273a1617696">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="55fb4905-a811-46e2-9192-771e2fb958cc">
      <name>УпаковочныйЛист</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="75fac7f0-d3fd-4458-a727-7598962ea772">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1f572790-edb3-4f4d-b716-aac43eeb7c85">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f4b9edd5-b41d-4b6b-86c5-b4d3896e8b32">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="608ab205-e85c-4c0c-bb0a-19c0fcca2cd5">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

erpdev.СХК_Расширение/src/Catalogs/УпаковкиЕдиницыИзмерения/УпаковкиЕдиницыИзмерения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>УпаковкиЕдиницыИзмерения</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <owners>Checked</owners>
  </extension>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Номенклатура</owners>
  <owners>Catalog.НаборыУпаковок</owners>
  <attributes extendedConfigurationObject="4378e490-1e5e-4dd6-a3db-03d426ec7986">
    <name>ТипИзмеряемойВеличины</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4dc73fe7-64ac-43ce-ab0c-df92d01c6311">
    <name>МинимальноеКоличествоУпаковокМногооборотнойТары</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="e0d07478-37ac-42f6-a26a-04f4fa4c4743">
    <name>ЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="23aae39e-0410-48bc-917a-96177b6e468b">
    <name>ТипУпаковки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ebb5bfee-de18-4d14-a24f-e32cbdd90cf9">
    <name>Безразмерная</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a7f52563-0c7c-4de6-ac07-6ef01ff7688d">
    <name>Числитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="35306e02-2ad1-4232-a398-068a769610be">
    <name>ОбъемЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="be5c2342-1fad-40cf-b4f7-a1017bc7e542">
    <name>КоличествоУпаковок</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="af87b08a-d7f9-4ad8-9eec-e3f927c89172">
    <name>Знаменатель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="df4a78ba-9180-411a-943d-2eaf96f21d69">
    <name>СкладскаяГруппа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ba8289fe-be8a-45a4-819c-2c2f84c4de2f">
    <name>Вес</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="5aa38e35-acdf-4eae-a145-4407937beec7">
    <name>ХарактеристикаМногооборотнаяТара</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fe815fb5-1875-4130-acf3-35d54b6300d2">
    <name>ПоставляетсяВМногооборотнойТаре</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f74a4575-a405-4411-b8a1-f7dda30e2967">
    <name>Глубина</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="922b22b5-b814-4d15-b669-ded6f1e11a61">
    <name>ВесЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7304712c-4a4e-40e0-be6c-a895e78d8825">
    <name>Типоразмер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6f2cd6a4-d354-43cb-b6e5-9f43829d8bc3">
    <name>Высота</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="7b61ba6a-896e-4ef0-98cc-bb012362f16c">
    <name>ВысотаЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1306a2c8-039b-4b1b-a808-f8fc27b47f72">
    <name>Ширина</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c0192ca1-e274-4de7-a7bd-ffca9512f173">
    <name>ШиринаЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c40dec99-d7f0-45f7-94f9-5288383ea7f7">
    <name>ГлубинаЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="993b535f-c665-4cc4-b466-d11667bec4fa">
    <name>Объем</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>18</precision>
          <scale>6</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="57ed9ee0-517f-4fb9-bc74-2d8fcd4d0a4b">
    <name>НоменклатураМногооборотнаяТара</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

erpdev.СХК_Расширение/src/DataProcessors/СХК_МобильныйСкладСырье/Forms/ФормаСборкиПоступления/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.Адрес);
	Если ЗначениеЗаполнено(СтруктураПараметров.ДокументПО) Тогда
		ЭтотОбъект.ДокументПО = СтруктураПараметров.ДокументПО;
		ЗаполнитьФорму(СтруктураПараметров.СтрокаЗаказПоставщику);
	Иначе
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФорму(СтрокаЗаказа)
	
	ЭтотОбъект.Номенклатура = СтрокаЗаказа.Номенклатура;
	ЭтотОбъект.НомерСтрокиДокумента = СтрокаЗаказа.НомерСтрокиДокумента-1;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Номенклатура",СтрокаЗаказа.Номенклатура);
	Строки = ЭтотОбъект.ДокументПО.Распоряжение.Товары.НайтиСтроки(Отбор);
	
	ЭтотОбъект.Заказано = Строка(Строки[0].КоличествоУпаковок) + " " + Строка(СтрокаЗаказа.Номенклатура.ЕдиницаИзмерения);
	
	ЭтотОбъект.Принято = Строка(СтрокаЗаказа.КоличествоПринято) + " " + Строка(СтрокаЗаказа.Номенклатура.ЕдиницаИзмерения);
	
	Вложение = ПроверитьВложение(СтрокаЗаказа.Номенклатура);
	ЭтотОбъект.КоличествоВложений = ?(Вложение>0,Вложение,0);
	
	Если Вложение >0  Тогда
		Элементы.ГруппаУпаковки.Видимость = Истина;
	//	ЭтотОбъект.КоличествоВложений = Вложение;
	//	ЭтаФОрма.Элементы.ГруппаКоличество.Видимость = Истина;
	//	ЭтаФОрма.Элементы.КоличествоУпаковокПринято.Видимость = Истина;	
	//	ЭтаФОрма.Элементы.КоличествоУпаковокПринято1.Видимость = Ложь;	
	//	
	//Иначе
	//	ЭтотОбъект.КоличествоВложений = 0;
	//	ЭтаФОрма.Элементы.ГруппаКоличество.Видимость = Ложь;
	//	ЭтаФОрма.Элементы.КоличествоУпаковокПринято1.Видимость = Истина;	
	//	ЭтаФОрма.Элементы.КоличествоУпаковокПринято.Видимость = Ложь;	
	КонецЕсли;
	//
	Если СтрокаЗаказа.Номенклатура.ВидНоменклатуры.ИспользоватьСерии  Тогда
	//	Элементы.ГруппаСерииНоменклатуры.Видимость = Ложь;
	//	ЭтотОбъект.ПараметрыУказанияСерий = Ложь;
	//Иначе 
		//Элементы.КоличествоУпаковокПринято.Видимость = Ложь;
		Элементы.ГруппаСерииНоменклатуры.Видимость = Истина;
		ЭтотОбъект.ИспользоватьСерии = Истина;
		Отбор = Новый Структура;
		Отбор.Вставить("Склад",ДокументПО.Склад);
		Отбор.Вставить("ПолитикаУчетаСерий",Справочники.ПолитикиУчетаСерий.НайтиПоНаименованию("Учет себестоимости по сериям"));
		Строки = СтрокаЗаказа.Номенклатура.ВидНоменклатуры.ПолитикиУчетаСерий.НайтиСтроки(Отбор);
		
		Если Строки.Количество()>=1 Тогда
			ЭтотОбъект.ПараметрыУказанияСерий = Истина;
		КонецЕсли;
		
	КонецЕсли;
	//
	//
	//ЭтотОбъект.СерииНоменклатуры = СтрокаЗаказа.СерияНоменклатуры;
	//ЭтотОбъект.КоличествоУпаковок = СтрокаЗаказа.КоличествоУпаковок; 
	Если СтрокаЗаказа.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка() Тогда
		ЭтотОбъект.Упаковка = СтрокаЗаказа.Номенклатура.ЕдиницаИзмерения;
	Иначе
		ЭтотОбъект.Упаковка = СтрокаЗаказа.Упаковка;
	КонецЕсли;
	//
	Если СтрокаЗаказа.Принято  Тогда 
		СЗ = РасчитатьКоличествоУпаковок();
		Элементы.Добавить.Видимость = Ложь;
		Элементы.Изменить.Видимость = Истина;
		//Если СтрокаЗаказа.СерияНоменклатуры = Справочники.СерииНоменклатуры.ПустаяСсылка() Тогда
		//	Элементы.СоздатьСерииНоменклатуры.Доступность = Ложь;
		//ИначеЕсли Не СтрокаЗаказа.СерияНоменклатуры.Пустая() Тогда
		//	ЭтотОбъект.Упаковка = СтрокаЗаказа.СерияНоменклатуры.СХК_Упаковка;
		//КонецЕсли;
		//Если СтрокаЗаказа.Упаковка =  СтрокаЗаказа.Номенклатура.ЕдиницаИзмерения Тогда 
		//	ЭтотОбъект.ДополнительноеКоличество = СЗ.КоличествоУпаковок;
		//	Элементы.КоличествоУпаковокПринято.Доступность = Ложь;
		//Иначе
		//	//ЭтотОбъект.КоличествоУпаковокПринято = СтрокаЗаказа.КоличествоПринято/ЭтотОбъект.Упаковка.Числитель; 
		//	ЭтотОбъект.КоличествоУпаковокПринято = СЗ.КоличествоУпаковок; 
		//КонецЕсли;	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция РасчитатьКоличествоУпаковок()
	СтрокаДокумента = ДокументПО.Товары[ЭтотОбъект.НомерСтрокиДокумента];
	
	СтруктураСтрока = Новый Структура("КоличествоУпаковок,Серия");
	ЗаполнитьЗначенияСвойств(СтруктураСтрока, СтрокаДокумента);	 
	
	КоличествоУпаковок = СтрокаДокумента.КоличествоУпаковок;
	Если Не СтрокаДокумента.Серия.Пустая() Тогда
		Если ЗначениеЗаполнено(СтрокаДокумента.Серия.СХК_Упаковка) Тогда
			КоличествоУпаковок = СтрокаДокумента.КоличествоУпаковок / СтрокаДокумента.Серия.СХК_Упаковка.Числитель;
		КонецЕсли;
	КонецЕсли;  
	
	СтруктураСтрока.Вставить("КоличествоУпаковок",КоличествоУпаковок);

	Возврат СтруктураСтрока;
КонецФункции


&НаКлиенте
Процедура ВыборУпаковки(Команда)
	ОткрытьФормуВыбораУпаковки();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораУпаковки()
	СтандартнаяОбработка = Ложь;
	ПараметрыФормыОстатки = Новый Структура;
	ПараметрыФормыОстатки.Вставить("Номенклатура",ЭтотОбъект.Номенклатура);
	АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
	_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
	//@skip-check notify-description-to-server-procedure
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыВыборУпаковки", ЭтаФорма);
	ОткрытьФорму("Обработка.СХК_МобильныйСкладСырье.Форма.ФормаУпаковки", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс );
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработатьЗакрытиеФормыВыборУпаковки(Значение, ДопПараметры) Экспорт
	Если ЗначениеЗаполнено(Значение) Тогда
		ЭтаФорма.Элементы.Декорация1.Заголовок = "";
		Если Не Значение.Упаковка.Пустая() Тогда
			ЭтотОбъект.Упаковка = Значение.Упаковка; 
			//Элементы.КоличествоУпаковокПринято.Доступность = Истина;
			//ПересчитатьУпаковки();
		Иначе
			ЭтотОбъект.Упаковка = ЕдиницаИзмеренияНоменклатуры();
			//Элементы.КоличествоУпаковокПринято.Доступность = Ложь;
			ОчиститьКоличествоУпаковок();
		КонецЕсли; 
		ОчиститьСерию();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПересчитатьУпаковки()
	ЭтаФорма.КоличествоУпаковокПринято = КоличествоУпаковокПринято/Упаковка.Числитель;			
КонецПроцедуры

&НаСервере
Функция ЕдиницаИзмеренияНоменклатуры()
	Возврат ЭтотОбъект.Номенклатура.ЕдиницаИзмерения;	
КонецФункции 

&НаСервере
Процедура ОчиститьСерию()
	ЭтаФорма.СерииНоменклатуры = Справочники.СерииНоменклатуры.ПустаяСсылка();	
КонецПроцедуры

&НаСервере
Процедура ОчиститьКоличествоУпаковок()
	ЭтотОбъект.КоличествоУпаковокПринято = 0;
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	
	Если ЭтаФорма.КоличествоВложений = 0 И ЭтаФорма.ПараметрыУказанияСерий = Ложь Тогда
		АктивироватьКоличествоУпаковокПринято();	
	ИначеЕсли ЭтаФорма.КоличествоВложений = 0 И ЭтаФорма.ПараметрыУказанияСерий = Истина Тогда 
		ПодключитьОбработчикОжидания("ОткрытьФормуСозданииСерииПриОткрытии",0.1,Истина) ;
	ИначеЕсли ЭтаФорма.КоличествоВложений > 0 И ЭтаФорма.ПараметрыУказанияСерий = Истина Тогда  
		ПодключитьОбработчикОжидания("ОткрытьФормуВыбораУпаковкиПриОткрытии",0.1,Истина) ;
	//Иначе
	//	ПодключитьОбработчикОжидания("ОткрытьФормуВыбораУпаковкиПриОткрытии",0.1,Истина) ;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСозданииСерииПриОткрытии() Экспорт
		ОткрытьФормуСозданииСерии();
КонецПроцедуры   
	
&НаКлиенте
Процедура ОткрытьФормуВыбораУпаковкиПриОткрытии() Экспорт
	ОткрытьФормуВыбораУпаковки();		
КонецПроцедуры 


&НаКлиенте
Процедура ОткрытьФормуСозданииСерии()
	СтандартнаяОбработка = Ложь; 
	Если ЭтотОбъект.Упаковка.Пустая() = Истина И ЭтаФОрма.Элементы.ВыборУпаковки.Видимость = Истина Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждениеУпаковки", ЭтотОбъект);	
		ПоказатьПредупреждение(Оповещение,"Заполните УПАКОВКУ",5,"Внимание!!!");
	Иначе
		ПараметрыФормыОстатки = Новый Структура;
		ПараметрыФормыОстатки.Вставить("НомерВходящегоДокумента",ДокументПОНомерВходящегоДокумента());
		ПараметрыФормыОстатки.Вставить("Номенклатура",ЭтотОбъект.Номенклатура);
		ПараметрыФормыОстатки.Вставить("Упаковка",ЭтотОбъект.Упаковка);
		ПараметрыФормыОстатки.Вставить("СерииНоменклатуры",ЭтотОбъект.СерииНоменклатуры);
		АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
		_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
		//@skip-check notify-description-to-server-procedure
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыЗаказПоставщика", ЭтаФорма);
		ОткрытьФорму("Обработка.СХК_МобильныйСкладСырье.Форма.ФормаСерии", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияПредупреждениеУпаковки(Значение) Экспорт
		
КонецПроцедуры


&НаКлиенте
Процедура ОбработатьЗакрытиеФормыЗаказПоставщика(Значение, ДопПараметры) Экспорт
	Если ЗначениеЗаполнено(Значение) Тогда                  
		ЭтотОбъект.СерииНоменклатуры = ПолучитьСериюПоНомеру(Строка(Значение.Номер),ЭтотОбъект.Номенклатура); 
		Если ЭтаФорма.Элементы.КоличествоУпаковокПринято.Видимость = Истина Тогда
			ОчиститьКоличествоУпаковокПринято();
			АктивироватьКоличествоУпаковокПринято();
		КонецЕсли;
		
		ЭтаФорма.Элементы.Декорация1.Заголовок = "";
	КонецЕсли;

КонецПроцедуры

 &НаСервере
Функция ДокументПОНомерВходящегоДокумента() 
	Возврат ЭтотОбъект.ДокументПО.НомерВходящегоДокумента;
КонецФункции


 &НаСервере
Процедура ОчиститьКоличествоУпаковокПринято() 
	ЭтотОбъект.КоличествоУпаковокПринято = 0;
КонецПроцедуры
 
	 
 &НаСервере
 Функция  ПолучитьСериюПоНомеру(Номер,Номенклатура) 
	 
	СсылкаСерия = Справочники.СерииНоменклатуры.ПустаяСсылка();
	 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	СерииНоменклатуры.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	               |ГДЕ
	               |	СерииНоменклатуры.Наименование = &Номер
	               |	И СерииНоменклатуры.ВидНоменклатуры = &ВидНоменклатуры" ;
	Запрос.УстановитьПараметр("Номер",Номер);
	Запрос.УстановитьПараметр("ВидНоменклатуры",Номенклатура.ВидНоменклатуры);
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда 
		СсылкаСерия =  Рез.Ссылка;
	КонецЕсли;
	
 	Возврат  СсылкаСерия;
	
КонецФункции


&НаКлиенте
Процедура АктивироватьКоличествоУпаковокПринято() 
    Элементы.Количество.Доступность = Истина; 
	Элементы.Количество.ОбновитьТекстРедактирования();
	Элементы.Количество.Видимость = Ложь;
	Элементы.Количество.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.Количество; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
	
КонецПроцедуры 




Функция ПроверитьВложение(Номенклатура)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	УпаковкиЕдиницыИзмерения.Ссылка КАК Ссылка,
	               |	УпаковкиЕдиницыИзмерения.Наименование КАК Наименование,
	               |	УпаковкиЕдиницыИзмерения.Числитель КАК Числитель,
	               |	УпаковкиЕдиницыИзмерения.Знаменатель КАК Знаменатель,
	               |	УпаковкиЕдиницыИзмерения.Представление КАК Представление
	               |ИЗ
	               |	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
	               |ГДЕ
	               |	УпаковкиЕдиницыИзмерения.Владелец = &Владелец";
	Запрос.УстановитьПараметр("Владелец",Номенклатура); 
	Рез = Запрос.Выполнить().Выгрузить();
	Возврат Рез.Количество();
КонецФункции

&НаСервере
Функция ПолучитьПриходныйОрдер(Заказ)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПриходныйОрдерНаТовары.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ПриходныйОрдерНаТовары КАК ПриходныйОрдерНаТовары
	               |ГДЕ
	               |	ПриходныйОрдерНаТовары.ПометкаУдаления = ЛОЖЬ
	               |	И ПриходныйОрдерНаТовары.Проведен = ИСТИНА
	               |	И ТИПЗНАЧЕНИЯ(ПриходныйОрдерНаТовары.Распоряжение) = ТИП(Документ.ЗаказПоставщику)
	               |	И ПриходныйОрдерНаТовары.Распоряжение = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",Заказ.Ссылка );
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.Ссылка;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ДобавитьНаСервере() 
	
	Ош = Истина;
	
	Если ЭтотОбъект.КоличествоУпаковокПринято = 0 И ЭтотОбъект.ДополнительноеКоличество = 0 Тогда
		Ош = "Укажите количество";
	ИначеЕсли ЭтотОбъект.ПараметрыУказанияСерий = Истина И ЭтотОбъект.СерииНоменклатуры = Справочники.СерииНоменклатуры.ПустаяСсылка() Тогда
		Ош = "Заполните серию";
	ИначеЕсли ЭтотОбъект.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка() Тогда
		Ош = "Заполните УПАКОВКУ";
	Иначе
		Док = ЭтотОбъект.ДокументПО.ПолучитьОбъект();
		
		//Если ЭтотОбъект.ДополнительноеКоличество > 0 Тогда 
		//	Т = Док.Товары.Добавить();
		//	Т.Номенклатура = ЭтотОбъект.Номенклатура; 
		//	Т.Количество = ЭтотОбъект.ДополнительноеКоличество;
		//	Т.КоличествоУпаковок = ЭтотОбъект.ДополнительноеКоличество;
		//	
		//	Если ЭтотОбъект.ПараметрыУказанияСерий = Истина Тогда
		//		Т.СтатусУказанияСерий = 14; 
		//		Т.Серия = ЭтотОбъект.СерииНоменклатуры.Ссылка;
		//	Иначе
		//		Т.СтатусУказанияСерий = 0;
		//	КонецЕсли; 
		//КонецЕсли;
		
		Если ЭтотОбъект.КоличествоУпаковокПринято > 0 Тогда  
			
			ТТ = Док.Товары.Выгрузить();
			
			Т = ТТ.Добавить();
			Т.Номенклатура = ЭтотОбъект.Номенклатура; 
			Т.Количество = ЭтотОбъект.КоличествоУпаковокПринято * ЭтотОбъект.Упаковка.Числитель;
			Т.КоличествоУпаковок = ЭтотОбъект.КоличествоУпаковокПринято * ЭтотОбъект.Упаковка.Числитель ;
			Если ЭтотОбъект.ПараметрыУказанияСерий = Истина Тогда
				Т.СтатусУказанияСерий = 14; 
				Т.Серия = ЭтотОбъект.СерииНоменклатуры.Ссылка;
			Иначе
				Т.СтатусУказанияСерий = 0;
			КонецЕсли; 
			ТТ.Свернуть("Номенклатура,Серия,СтатусУказанияСерий","Количество,КоличествоУпаковок");
			Док.Товары.Очистить();
			Док.Товары.Загрузить(ТТ);
		Попытка
			Док.Записать(РежимЗаписиДокумента.Проведение);
			Ош = Ложь; 
			ЭтотОбъект.НомерСтрокиДокумента = Док.Товары.Количество()+1;
		Исключение
			Ош = "При проведении возникла ошибка"
		КонецПопытки; 
		КонецЕсли;
	КонецЕсли;		

	Возврат  Ош;
	
КонецФункции


&НаКлиенте
Процедура Добавить(Команда)
	Ош = ДобавитьНаСервере();
	Если Ош = Ложь Тогда
		ЭтаФорма.Закрыть();
	Иначе
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждениеСохранения", ЭтотОбъект);	
		ПоказатьПредупреждение(Оповещение,Строка(Ош),5,"Внимание!!!");
	КонецЕсли;
КонецПроцедуры   


&НаКлиенте
Процедура ПослеЗакрытияПредупреждениеСохранения(Значение) Экспорт 
					
КонецПроцедуры


&НаКлиенте
Процедура ИзменитьСтрокуДокумента(Команда)
	Ош = ИзменитьНаСервере();
	Если Ош = Ложь Тогда
		ЭтаФорма.Закрыть();
	Иначе
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждениеСохранения", ЭтотОбъект);	
		ПоказатьПредупреждение(Оповещение,Строка(Ош),5,"Внимание!!!");
	КонецЕсли;
КонецПроцедуры 


&НаСервере
Функция ИзменитьНаСервере() 
	
	Ош = Истина;
	
	Если ЭтотОбъект.ПараметрыУказанияСерий = Истина И ЭтотОбъект.СерииНоменклатуры = Справочники.СерииНоменклатуры.ПустаяСсылка() Тогда
		Ош = "Заполните серию";
	Иначе
		Док = ЭтотОбъект.ДокументПО.ПолучитьОбъект();
		
		Таб = Док.Товары.Выгрузить();
		
		//Отбор = Новый Структура;
		//Отбор.Вставить("Номенклатура", ЭтотОбъект.Номенклатура);
		//Отбор.Вставить("Серия", ЭтотОбъект.СерииНоменклатуры.Ссылка);
		////Отбор.Вставить("Упаковка", ЭтотОбъект.Упаковка);
		//
		//Строки = Таб.НайтиСтроки(Отбор);
		//Если Строки.Количество()>=1 Тогда
		Если ЭтотОбъект.КоличествоУпаковокПринято = 0 И ЭтотОбъект.ДополнительноеКоличество = 0	Тогда 
			Таб.Удалить(ЭтотОбъект.НомерСтрокиДокумента);
		Иначе
			
			Если ЭтотОбъект.КоличествоУпаковокПринято > 0 ИЛИ ЭтотОбъект.ДополнительноеКоличество > 0 Тогда 
				Если ЭтотОбъект.КоличествоУпаковокПринято > 0 Тогда
					Таб[ЭтотОбъект.НомерСтрокиДокумента].Количество = ЭтотОбъект.КоличествоУпаковокПринято*ЭтотОбъект.Упаковка.Числитель;
					Таб[ЭтотОбъект.НомерСтрокиДокумента].КоличествоУпаковок = ЭтотОбъект.КоличествоУпаковокПринято*ЭтотОбъект.Упаковка.Числитель;
					//Строки[0].Упаковка = ЭтотОбъект.Упаковка;
				КонецЕсли;
				//Если ЭтотОбъект.ДополнительноеКоличество > 0 Тогда
				//	Таб[ЭтотОбъект.НомерСтрокиДокумента].Количество = ЭтотОбъект.ДополнительноеКоличество;
				//	Таб[ЭтотОбъект.НомерСтрокиДокумента].КоличествоУпаковок = ЭтотОбъект.ДополнительноеКоличество;
				//	//Строки[0].Упаковка = ЭтотОбъект.Номенклатура.ЕдиницаИзмерения;
				//КонецЕсли;
				
			//Иначе
			//	Таб.Удалить(Строки[0]);
		КонецЕсли;
			
		КонецЕсли;
		
		Док.Товары.Очистить(); 
		
		Таб.Свернуть("Номенклатура,Серия,СтатусУказанияСерий","Количество,КоличествоУпаковок");
		
		Док.Товары.Загрузить(Таб);


		Попытка
			Док.Записать(РежимЗаписиДокумента.Проведение);
			Ош = Ложь;
		Исключение
			Ош = "При проведении возникла ошибка"
		КонецПопытки;
	КонецЕсли;		

	Возврат  Ош;
	
КонецФункции

&НаКлиенте
Процедура СоздатьСерииНоменклатуры(Команда)
	ОткрытьФормуСозданииСерии();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	СтуктураВозврат = Новый Структура;
	СтуктураВозврат.Вставить("СерииНоменклатуры",ЭтаФорма.СерииНоменклатуры);
	СтуктураВозврат.Вставить("Номенклатура",ЭтаФорма.Номенклатура);
	СтуктураВозврат.Вставить("Упаковка",ЭтаФорма.Упаковка);
	СтуктураВозврат.Вставить("КоличествоУпаковокПринято",ИтогКоличестваПоФорме());
	СтуктураВозврат.Вставить("НомерСтрокиДокумента",ЭтаФорма.НомерСтрокиДокумента);
	ОповеститьОВыборе(СтуктураВозврат); 
КонецПроцедуры

&НаСервере
Функция ИтогКоличестваПоФорме()
	Возврат  ЭтотОбъект.КоличествоУпаковокПринято*ЭтотОбъект.Упаковка.Числитель + ЭтотОбъект.ДополнительноеКоличество; 
	
КонецФункции

&НаСервере
Процедура УпаковкаПриИзмененииНаСервере()
	ЭтаФорма.СерииНоменклатуры = Справочники.СерииНоменклатуры.ПустаяСсылка(); 
	ЭтаФорма.КоличествоУпаковокПринято = 0;
КонецПроцедуры

&НаКлиенте
Процедура УпаковкаПриИзменении(Элемент)
	УпаковкаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Плюс(Команда)
	КоличествоУпаковокПринято = КоличествоУпаковокПринято + 1;
КонецПроцедуры

&НаКлиенте
Процедура Минус(Команда)
	КоличествоУпаковокПринято = КоличествоУпаковокПринято - 1;
КонецПроцедуры
